app/controllers/users_controller.rb

  def create
  	#fonctionne avec le formulaire : HTML & RUBY(form_tag)
  	@username = params["username"]
  	@email = params["email"]
  	@bio = params["bio"]
  	User.new(username: @username, email: @email, bio: @bio).save
---
INSERT INTO "users" ("username", "email", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Cinderella"], ["email", "princesse_une_nui@gmail.com"], ["bio", "rECHERCe UnE cHaUSsuRe"], ["created_at", "2018-07-31 14:18:07.259050"], ["updated_at", "2018-07-31 14:18:07.259050"]]

  def createBis
  	#fonctionne avec le formulaire : RUBY(form_for)
  	@username = params["user"]["username"]
  	@email = params["user"]["email"]
  	@bio = params["user"]["bio"]
  	User.create(username: @username, email: @email, bio: @bio)
---
INSERT INTO "users" ("username", "email", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "aaa"], ["email", "aq@gmail.com"], ["bio", "sdf"], ["created_at", "2018-07-31 17:34:43.259840"], ["updated_at", "2018-07-31 17:34:43.259840"]]